const config = require('../config')
const {cmd , commands} = require('../command')
cmd({
    pattern: "about",
    alias: ["qadeer-ai","whois"], 
    react: "👑",
    desc: "get owner dec",
    category: "main",
    filename: __filename
},
async(conn, mek, m,{from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {
try{
let about = `
*╭━━〔 QADEER AI 〕━━┈⊷*

*👋 HELLO ${pushname}*

*╰──────────────┈⊷*
*╭━━━〔 MY ABOUT 〕━━━┈⊷*
*┃★╭──────────────*
*┃★│* *ᴡᴇʟᴄᴏᴍᴇ ɪᴛs ǫᴀᴅᴇᴇʀ-ᴀɪ-ʙᴏᴛ*
*┃★│* *ᴄʀᴇᴀᴛᴇʀ : ǫᴀᴅᴇᴇʀ*
*┃★│* *ʀᴇᴀʟ ɴᴀᴍᴇ : ǫᴀᴅᴇᴇʀ ᴋʜᴀɴ*
*┃★│* *ᴘᴜʙʟɪᴄ ɴᴀᴍᴇ : ᴀᴘɴᴀ ʜᴀᴄᴋᴇʀ*
*┃★│* *ᴀɢᴇ : 18 ʏᴇᴀʀ*
*┃★│* *ᴄɪᴛʏ : ᴍᴜʟᴛᴀɴ*
*┃★│* *ᴀ sɪᴍᴘʟᴇ ᴡʜᴀᴛsᴀᴘᴘ ᴅᴇᴠᴇʟᴏᴘᴇʀ*
*┃★╰──────────────*
*╰━━━━━━━━━━━━━━━┈⊷*
> *◆◆◆◆◆◆◆◆◆◆◆◆*

*[ • SPECIAL THANKS FOR • ]*
*╭━━━〔 THANKS TO 〕━━━┈⊷*
*┃★╭──────────────*
*┃★│* *▢ᴀʙʙᴀs(ʟᴏᴠᴇʟʏ ʙʜᴀɪ)*
*┃★│* *▢ʜᴜᴢᴀɪғᴀ(ᴍʏ ᴊᴀᴀɴ)*
*┃★│* *▢sʜᴀʜʙᴀᴢ(ᴅɪʟ ᴋᴀ ᴛᴜᴋʀᴀ)*
*┃★│* *▢ᴍᴜᴅᴀssɪʀ(ʙᴇsᴛ ғʀɪᴇɴᴅ)*
*┃★╰──────────────*
*╰━━━━━━━━━━━━━━━┈⊷*

*•────────────•⟢*
> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ǫᴀᴅᴇᴇʀ ᴀɪ₉₂
*•────────────•⟢*
`

await conn.sendMessage(from,{image:{url:`https://qu.ax/Pusls.jpg`},caption:about,
                             contextInfo: {
    mentionedJid: [m.sender],
    forwardingScore: 999,
    isForwarded: true,
    forwardedNewsletterMessageInfo: {
      newsletterJid: '120363345872435489@newsletter',
      newsletterName: 'QADEER-AI',
      serverMessageId: 999
    }
  }
}, { quoted: mek });
} catch (e) {
console.log(e)
reply(`${e}`)
}
})
